Establish connection

In [1]:
%reload_ext google.cloud.bigquery
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="C:\\Users\\Cermati\\AppData\\Roaming\\gcloud\\application_default_credentials.json"
print(os.environ["GOOGLE_APPLICATION_CREDENTIALS"])

C:\Users\Cermati\AppData\Roaming\gcloud\application_default_credentials.json

Insert query here

In [79]:
%%bigquery param1 --project athena-179008

WITH contracts as (
    SELECT 
        CASE WHEN SUBSTR(orderId,1,3)='INS' THEN 'PAYLATER' ELSE 'CASH_LOAN' END as product
        , borrower_id as userId
        , orderId
        , entity_id
        , dpd
        , loan_amount/principal*balance_principal as balance_loan_amount
    FROM athena-179008.vayu_data_mart.view_ath_contracts
    WHERE status='ACTIVE'
    UNION ALL
    SELECT 
        'PAYLATER' as product
        , borrower_id as userId
        , orderId
        , entity_id
        , dpd
        , loan_amount/principal*balance_principal as balance_loan_amount
    FROM athena-179008.vayu_data_mart.view_trx_contracts
    WHERE status='ACTIVE'
)
, combined_data as (
    SELECT 
        c.*
        , CASE
            WHEN ra.latest_model_score_norescore < 360 THEN '1. <360'
            WHEN ra.latest_model_score_norescore <= 440 THEN '2. 360-440'
            WHEN ra.latest_model_score_norescore > 440 THEN '3. >440'
            ELSE '3. >440'
        END as score
        , CASE trim(upper(coalesce(a.currentCompanyAddressProvince,a.applicantCurrentResidenceProvince,a.applicantResidenceProvince)))
            WHEN 'NANGGROE ACEH DARUSSALAM' THEN 'ACEH'
            WHEN 'KEPULA TAN RIAU' THEN 'KEPULAUAN RIAU'
            WHEN 'JAWA TIMUR\nKOTA SURABAYA\n3576396206810002\nWW.A\nA ASTA\n PROVINSI JAWA TIMUR' THEN 'JAWA TIMUR'
            WHEN 'IMUR' THEN 'JAWA TIMUR'
            WHEN 'JAWA IINUI' THEN 'JAWA TIMUR'
            WHEN 'JAWA TARAT' THEN 'JAWA BARAT'
            WHEN '1 AA' THEN 'JAWA BARAT'
            WHEN 'DAERAH ISTIMEWA YOGYAKARTA' THEN 'DI YOGYAKARTA'
            WHEN 'BANTEN\nKOTA TANGERANG\n*3172016 1143000\nNIK\n PROVINS BANTEN' THEN 'BANTEN'
            WHEN 'NUSA TENGGARAT' THEN 'NUSA TENGGARA TIMUR'
            ELSE trim(upper(coalesce(a.currentCompanyAddressProvince,a.applicantCurrentResidenceProvince,a.applicantResidenceProvince)))
        END as province
        , COALESCE(a.applicantGender,'MALE') as sex
        , CASE 
            WHEN a.typeOfJobs IS NULL THEN 'Pegawai Swasta'
            ELSE a.typeOfJobs
        END as job_type
        , CASE a.currentCompanyIndustry
            WHEN 'Asuransi/Forex' THEN 'Financial Services' 
            WHEN 'Biro Jasa' THEN 'Services' 
            WHEN 'General & Wholesale Trading' THEN 'Trading/Warehouse' 
            WHEN 'Hukum dan Perpajakan' THEN 'Law and Taxation' 
            WHEN 'Industri/Pabrik' THEN 'Industrial/Factory' 
            WHEN 'Jasa/Pelayanan' THEN 'Services' 
            WHEN 'Kesehatan/Klinik' THEN 'Health Services' 
            WHEN 'Keuangan' THEN 'Financial Services' 
            WHEN 'Keuangan/Bank' THEN 'Financial Services' 
            WHEN 'Konsultan' THEN 'Consultancy ' 
            WHEN 'Kontraktor/Properti' THEN 'Contractor/Real Estate' 
            WHEN 'Medis' THEN 'Health Services' 
            WHEN 'Pariwisata' THEN 'Leisure' 
            WHEN 'Pemerintahan' THEN 'Government Sector' 
            WHEN 'Perdagangan' THEN 'Trading/Warehouse' 
            WHEN 'Pergudangan' THEN 'Trading/Warehouse' 
            WHEN 'Perkebunan' THEN 'Agriculture' 
            WHEN 'Pertambangan' THEN 'Mining' 
            WHEN 'Properti' THEN 'Contractor/Real Estate' 
            WHEN 'Restoran/Bar/Cafe' THEN 'Hospitality' 
            WHEN 'Retail' THEN 'Retail' 
            WHEN 'Spesialis' THEN 'Professional' 
            WHEN 'Telekomunikasi' THEN 'Telecommunication' 
            WHEN 'Transportasi' THEN 'Transportation' 
            WHEN 'perdagangan' THEN 'Trading/Warehouse' 
            WHEN 'service' THEN 'Services' 
            ELSE 'Others' 
        END as company_industry
        , CASE 
            WHEN u.age <17 THEN '<17'
            WHEN u.age <=22 THEN '17-22'
            WHEN u.age <=30 THEN '23-30'
            WHEN u.age <=40 THEN '31-40'
            WHEN u.age >40 THEN '>40'
            WHEN u.age is null THEN '31-40'
        END as age
        , CASE WHEN dpd BETWEEN 31 AND 120 THEN balance_loan_amount ELSE 0 END as outstanding_30plus
        , CASE WHEN dpd BETWEEN 61 AND 120 THEN balance_loan_amount ELSE 0 END as outstanding_60plus
        , CASE WHEN dpd <= 120 THEN balance_loan_amount ELSE 0 END as outstanding
    FROM contracts c 
    INNER JOIN data-platform-indodana.vayu.indodana_athena_applications a ON a.orderId=c.orderId
    LEFT JOIN athena-179008.vayu_data_mart.dm_application_risk_analytics ra ON ra.orderId=a.orderId
    LEFT JOIN `athena-179008.vayu_data_mart.indodanamarketing_user_segmentation` u ON u.userId=c.userId
    WHERE dpd<=120
)

SELECT
    *
#     age
#     , sex
#     , job_type
#     , company_industry
#     , score
#     , province
#     , CAST(SUM(outstanding) AS INT64) as outstanding
#     , CAST(SUM(outstanding_30plus) AS INT64) as outstanding_30plus
#     , CAST(SUM(outstanding_60plus) AS INT64) as outstanding_60plus
FROM combined_data
# GROUP BY 1,2,3,4,5,6

Sample 5 rows to check

In [80]:
param1.shape
# param1.dtypes

(268009, 15)

In [81]:
param1.head()

,product,userId,orderId,entity_id,dpd,balance_loan_amount,score,province,sex,job_type,company_industry,age,outstanding_30plus,outstanding_60plus,outstanding
0,PAYLATER,30ead2bd-be6b-4c23-9739-7767e31bca58,CLI-7TM4EGTN,TRX-U323NN,-7,1.764908e+06,2. 360-440,JAWA BARAT,MALE,Pegawai Swasta,Industrial/Factory,31-40,0.0,0.0,1.764908e+06
1,PAYLATER,30ead2bd-be6b-4c23-9739-7767e31bca58,CLI-7TM4EGTN,TRX-LEN18T,-9,1.069950e+06,2. 360-440,JAWA BARAT,MALE,Pegawai Swasta,Industrial/Factory,31-40,0.0,0.0,1.069950e+06
2,PAYLATER,30ead2bd-be6b-4c23-9739-7767e31bca58,CLI-7TM4EGTN,TRX-LMHVO3,-12,5.616667e+05,2. 360-440,JAWA BARAT,MALE,Pegawai Swasta,Industrial/Factory,31-40,0.0,0.0,5.616667e+05
3,PAYLATER,37cd5d8d-848a-4d29-8225-0cf7e01ec776,CLI-P11C2Y6L,TRX-A608AM,-12,3.340660e+05,2. 360-440,JAWA BARAT,MALE,Wiraswasta,Trading/Warehouse,23-30,0.0,0.0,3.340660e+05
4,PAYLATER,37cd5d8d-848a-4d29-8225-0cf7e01ec776,CLI-P11C2Y6L,TRX-6HT1UO,-3,1.839920e+05,2. 360-440,JAWA BARAT,MALE,Wiraswasta,Trading/Warehouse,23-30,0.0,0.0,1.839920e+05

In [82]:
param1.groupby('age',dropna=False)['entity_id'].count()

age
17-22     10057
23-30     98743
31-40    111843
>40       47366
Name: entity_id, dtype: int64

In [83]:
param1.groupby('sex',dropna=False)['entity_id'].count()

sex
FEMALE    134879
MALE      133130
Name: entity_id, dtype: int64

In [85]:
param1.groupby('company_industry',dropna=False)['entity_id'].count()

company_industry
Agriculture                1027
Consultancy                5210
Contractor/Real Estate    12307
Financial Services        17316
Government Sector          7480
Health Services            8510
Hospitality                7793
Industrial/Factory        21723
Law and Taxation            931
Leisure                    4138
Mining                     2929
Others                    10665
Professional               1635
Retail                    66639
Services                  45215
Telecommunication          8284
Trading/Warehouse         40721
Transportation             5486
Name: entity_id, dtype: int64

In [86]:
param1.groupby('job_type',dropna=False)['entity_id'].count()

job_type
Driver Online            6
Freelance               56
Ibu Rumah Tangga     10681
Karyawan                 1
Pegawai BUMN          7156
Pegawai Negeri        7118
Pegawai Swasta      151824
Pelajar                  2
Profesional           3932
Tidak Bekerja            9
Wiraswasta           87224
Name: entity_id, dtype: int64

In [ ]:
# profession = param1.groupby('profession',dropna=False)['entity_id'].count().to_frame()
# profession.reset_index(inplace=True)
# profession.dtypes
# profession.to_excel('Testttt.xlsx',index=False)

In [87]:
param1.groupby('province',dropna=False)['entity_id'].count()

province
ACEH                            291
BALI                           3131
BANTEN                        28511
BENGKULU                         77
DI YOGYAKARTA                  3019
DKI JAKARTA                  108143
GORONTALO                        56
JAMBI                           422
JAWA BARAT                    70313
JAWA TENGAH                    8293
JAWA TIMUR                    24873
KALIMANTAN BARAT                713
KALIMANTAN SELATAN              497
KALIMANTAN TENGAH               191
KALIMANTAN TIMUR                963
KALIMANTAN UTARA                 44
KEPULAUAN BANGKA BELITUNG        53
KEPULAUAN RIAU                 2417
LAMPUNG                         830
MALUKU                           41
MALUKU UTARA                     65
NUSA TENGGARA BARAT             250
NUSA TENGGARA TIMUR             248
PAPUA                            10
RIAU                           1097
SULAWESI BARAT                   64
SULAWESI SELATAN               3008
SULAWESI TENGAH                  75
SULAWESI TENGGARA               100
SULAWESI UTARA                  334
SUMATERA BARAT                  665
SUMATERA SELATAN               4063
SUMATERA UTARA                 5152
Name: entity_id, dtype: int64

In [88]:
param1[(param1['province'].isna())]

Empty DataFrame
Columns: [product, userId, orderId, entity_id, dpd, balance_loan_amount, score, province, sex, job_type, company_industry, age, outstanding_30plus, outstanding_60plus, outstanding]
Index: []

In [89]:
print(param1.describe())
print(param1.isna().any())
print(param1.isnull().sum())

                 dpd  balance_loan_amount  outstanding_30plus  \
count  268009.000000         2.680090e+05        2.680090e+05
mean       -9.253909         7.454021e+05        6.468306e+04
std        26.285414         1.199086e+06        3.935110e+05
min      -348.000000         0.000000e+00        0.000000e+00
25%       -24.000000         7.437600e+04        0.000000e+00
50%       -12.000000         2.595000e+05        0.000000e+00
75%        -7.000000         9.687040e+05        0.000000e+00
max       120.000000         1.104425e+07        1.104425e+07

       outstanding_60plus   outstanding
count        2.680090e+05  2.680090e+05
mean         4.000115e+04  7.454021e+05
std          3.082001e+05  1.199086e+06
min          0.000000e+00  0.000000e+00
25%          0.000000e+00  7.437600e+04
50%          0.000000e+00  2.595000e+05
75%          0.000000e+00  9.687040e+05
max          1.104425e+07  1.104425e+07
product                False
userId                 False
orderId                False
entity_id              False
dpd                    False
balance_loan_amount    False
score                  False
province               False
sex                    False
job_type               False
company_industry       False
age                    False
outstanding_30plus     False
outstanding_60plus     False
outstanding            False
dtype: bool
product                0
userId                 0
orderId                0
entity_id              0
dpd                    0
balance_loan_amount    0
score                  0
province               0
sex                    0
job_type               0
company_industry       0
age                    0
outstanding_30plus     0
outstanding_60plus     0
outstanding            0
dtype: int64